nc: 3  # number of classes
scales: 
  n: [0.33, 0.25, 1024] 



# [from, repeats, module, args]
backbone:
  - [-1, 1, PatchEmbed_FasterNet, [40, 4, 4]]  # 0-P1/4
  - [-1, 1, BasicStage, [40, 4]]  # 1
  - [-1, 1, CoordAtt,[40,32]]
  - [-1, 1, PatchMerging_FasterNet, [80, 2, 2]]  # 2-P2/8
  - [-1, 1, BasicStage, [80, 6]]  # 3-P3/16
  - [-1, 1, CoordAtt,[80,32]]
  - [-1, 1, PatchMerging_FasterNet, [160, 2, 2]]  # 4
  - [-1, 1, BasicStage, [160, 8]]  # 5-P4/32
  - [-1, 1, CoordAtt,[160,32]]
  - [-1, 1, PatchMerging_FasterNet, [320, 2, 2]] # 6
  - [-1, 1, BasicStage, [320, 10]] # 7
  - [-1, 1, CoordAtt,[320,32]]
  - [-1, 1, SPPFCSPC, [320, 5]]  # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, VoVGSCSPC, [512,False]]   # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, VoVGSCSPC, [256,False]]  # 14 (P3/8-small)

  - [-1, 1, GSConv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P4
  - [-1, 3, VoVGSCSPC, [512,False]]  # 17 (P4/16-medium)

  - [-1, 1, GSConv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P5
  - [-1, 3, VoVGSCSPC, [1024,False]]  # 20 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)